hangcui1201/DSP_TI_TMS320F28379D/F28379D_Projects/libraries/boot_rom/f2838x/rev0/rom_sources/cpu1/F2838x_ROM/driverlib/epwm.h
    // Set the appropriate sync and load mode bits and also enable shadow
    // load mode. Shadow to active load can also be frozen.
    HWREGH(base + EPWM_O_AQCTL) = ((HWREGH(base + EPWM_O_AQCTL) &
          (~((0x3U << (uint16_t)aqModule) | // Clear AQ mode selection
            (0x3U << (uint16_t)syncModeOffset))) | // Clear Sync mode
            (0x1U << shadowModeOffset)) | // Enable Shadow mode
             ((((uint16_t)loadMode >> 2U) << syncModeOffset) | // sync mode
             (((uint16_t)loadMode & 0x3U) << (uint16_t)aqModule))); // AQ mode

}

//*****************************************************************************
//
//! Disable Action Qualifier shadow load mode
//!
//! \param base is the base address of the EPWM module.
//! \param aqModule is the Action Qualifier module value.
//!
//! This function disables the Action Qualifier  shadow load mode.
//! Valid values for the variables are:
//!  - aqModule
//!      - EPWM_ACTION_QUALIFIER_A - Action Qualifier A.
//!      - EPWM_ACTION_QUALIFIER_B - Action Qualifier B.
//!
//! \return None.
//
//*****************************************************************************
static inline void EPWM_disableActionQualifierShadowLoadMode(uint32_t base,
                                        EPWM_ActionQualifierModule aqModule)
{

    uint16_t shadowModeOffset;

    ASSERT(EPWM_isBaseValid(base));

    shadowModeOffset = 4U + (uint16_t)aqModule;

    // Disable shadow load mode. Action qualifier is loaded on
    // immediate mode only.
    HWREGH(base + EPWM_O_AQCTL) &= ~(1U << shadowModeOffset);

}

//*****************************************************************************
//
//! Set up Action qualifier trigger source for event T1
//!
//! \param base is the base address of the EPWM module.
//! \param trigger sources for Action Qualifier triggers.
//!
//! This function sets up the sources for Action Qualifier event T1.
//! Valid values for trigger are:
//!   - EPWM_AQ_TRIGGER_EVENT_TRIG_DCA_1       - Digital compare event A 1
//!   - EPWM_AQ_TRIGGER_EVENT_TRIG_DCA_2       - Digital compare event A 2
//!   - EPWM_AQ_TRIGGER_EVENT_TRIG_DCB_1       - Digital compare event B 1
//!   - EPWM_AQ_TRIGGER_EVENT_TRIG_DCB_2       - Digital compare event B 2
//!   - EPWM_AQ_TRIGGER_EVENT_TRIG_TZ_1        - Trip zone 1
//!   - EPWM_AQ_TRIGGER_EVENT_TRIG_TZ_2        - Trip zone 2
//!   - EPWM_AQ_TRIGGER_EVENT_TRIG_TZ_3        - Trip zone 3
//!   - EPWM_AQ_TRIGGER_EVENT_TRIG_EPWM_SYNCIN - ePWM sync
//!
//! \return None.
//
//*****************************************************************************
static inline void EPWM_setActionQualifierT1TriggerSource(uint32_t base,
                                    EPWM_ActionQualifierTriggerSource trigger)
{
    ASSERT(EPWM_isBaseValid(base));
    // Set T1 trigger source

    HWREGH(base + EPWM_O_AQTSRCSEL) =
         ((HWREGH(base + EPWM_O_AQTSRCSEL) & (~EPWM_AQTSRCSEL_T1SEL_M)) |
          ((uint16_t)trigger));
}

//*****************************************************************************
//
//! Set up Action qualifier trigger source for event T2
//!
//! \param base is the base address of the EPWM module.
//! \param trigger sources for Action Qualifier triggers.
//!
//! This function sets up the sources for Action Qualifier event T2.
//! Valid values for trigger are:
//!   - EPWM_AQ_TRIGGER_EVENT_TRIG_DCA_1       - Digital compare event A 1
//!   - EPWM_AQ_TRIGGER_EVENT_TRIG_DCA_2       - Digital compare event A 2
//!   - EPWM_AQ_TRIGGER_EVENT_TRIG_DCB_1       - Digital compare event B 1
//!   - EPWM_AQ_TRIGGER_EVENT_TRIG_DCB_2       - Digital compare event B 2
//!   - EPWM_AQ_TRIGGER_EVENT_TRIG_TZ_1        - Trip zone 1
//!   - EPWM_AQ_TRIGGER_EVENT_TRIG_TZ_2        - Trip zone 2
//!   - EPWM_AQ_TRIGGER_EVENT_TRIG_TZ_3        - Trip zone 3
//!   - EPWM_AQ_TRIGGER_EVENT_TRIG_EPWM_SYNCIN - ePWM sync
//!
//! \return None.
//
//*****************************************************************************
static inline void EPWM_setActionQualifierT2TriggerSource(uint32_t base,
                                    EPWM_ActionQualifierTriggerSource trigger)
{
    ASSERT(EPWM_isBaseValid(base));
    // Set T2 trigger source
    HWREGH(base + EPWM_O_AQTSRCSEL) =
          ((HWREGH(base + EPWM_O_AQTSRCSEL) & (~EPWM_AQTSRCSEL_T2SEL_M)) |
           ((uint16_t)trigger << EPWM_AQTSRCSEL_T2SEL_S));
}

//*****************************************************************************
//
//! Set up Action qualifier outputs
//!
//! \param base is the base address of the EPWM module.
//! \param epwmOutput is the ePWM pin type.
//! \param output is the Action Qualifier output.
//! \param event is the event that causes a change in output.
//!
//! This function sets up the Action Qualifier output on ePWM A or ePWMB,
//! depending on the value of epwmOutput, to a value specified by outPut based
//! on the input events - specified by event.
//! The following are valid values for the parameters.
//!   - epwmOutput
//!       - EPWM_AQ_OUTPUT_A          - ePWMxA output
//!       - EPWM_AQ_OUTPUT_B          - ePWMxB output
//!   - output
//!       - EPWM_AQ_OUTPUT_NO_CHANGE  - No change in the output pins
//!       - EPWM_AQ_OUTPUT_LOW        - Set output pins to low
//!       - EPWM_AQ_OUTPUT_HIGH       - Set output pins to High
//!       - EPWM_AQ_OUTPUT_TOGGLE     - Toggle the output pins
//!   - event
//!       - EPWM_AQ_OUTPUT_ON_TIMEBASE_ZERO       - Time base counter equals
//!                                                 zero
//!       - EPWM_AQ_OUTPUT_ON_TIMEBASE_PERIOD     - Time base counter equals
//!                                                 period
//!       - EPWM_AQ_OUTPUT_ON_TIMEBASE_UP_CMPA    - Time base counter up equals
//!                                                 COMPA
//!       - EPWM_AQ_OUTPUT_ON_TIMEBASE_DOWN_CMPA  - Time base counter down
//!                                                 equals COMPA
//!       - EPWM_AQ_OUTPUT_ON_TIMEBASE_UP_CMPB    - Time base counter up equals
//!                                                 COMPB
//!       - EPWM_AQ_OUTPUT_ON_TIMEBASE_DOWN_CMPB  - Time base counter down
//!                                                 equals COMPB
//!       - EPWM_AQ_OUTPUT_ON_T1_COUNT_UP         - T1 event on count up
//!       - EPWM_AQ_OUTPUT_ON_T1_COUNT_DOWN       - T1 event on count down
//!       - EPWM_AQ_OUTPUT_ON_T2_COUNT_UP         - T2 event on count up
//!       - EPWM_AQ_OUTPUT_ON_T2_COUNT_DOWN       - T2 event on count down
//!
//! \return None.
//
//*****************************************************************************
static inline void EPWM_setActionQualifierAction(uint32_t base,
                                   EPWM_ActionQualifierOutputModule epwmOutput,
                                   EPWM_ActionQualifierOutput output,
                                   EPWM_ActionQualifierOutputEvent event)
{
    uint32_t registerOffset;
    uint32_t registerTOffset;

    ASSERT(EPWM_isBaseValid(base));

    // Get the register offset
    registerOffset = EPWM_O_AQCTLA + (uint16_t)epwmOutput;
    registerTOffset = EPWM_O_AQCTLA2 + (uint16_t)epwmOutput;

    // If the event occurs on T1 or T2 events
    if(((uint16_t)event & 0x1U) == 1U)
    {
        // Write to T1U,T1D,T2U or T2D of AQCTLA2 register
        HWREGH(base + registerTOffset) =
         ((HWREGH(base + registerTOffset) & ~(3U << ((uint16_t)event - 1U))) |
          ((uint16_t)output << ((uint16_t)event - 1U)));
    }
    else
    {
        // Write to ZRO,PRD,CAU,CAD,CBU or CBD bits of AQCTLA register
        HWREGH(base + registerOffset) =
                ((HWREGH(base + registerOffset) & ~(3U << (uint16_t)event)) |
                 ((uint16_t)output << (uint16_t)event));
    }
}

//*****************************************************************************
//
//! Set up Action qualifier event outputs
//!
//! \param base is the base address of the EPWM module.
//! \param epwmOutput is the ePWM pin type.
//! \param action is the desired action when the specified event occurs
//!
//! This function sets up the Action Qualifier output on ePWMA or ePWMB,
//! depending on the value of epwmOutput, to a value specified by action
//! The following are valid values for the parameters.
//!   - epwmOutput
//!       - EPWM_AQ_OUTPUT_A          - ePWMxA output
//!       - EPWM_AQ_OUTPUT_B          - ePWMxB output
//!   - action
//!       - EPWM_AQ_OUTPUT_NO_CHANGE_ZERO     - Time base counter equals zero
//!                                             and no change in output pins
//!       - EPWM_AQ_OUTPUT_LOW_ZERO           - Time base counter equals zero
//!                                             and set output pins to low
//!       - EPWM_AQ_OUTPUT_HIGH_ZERO          - Time base counter equals zero
//!                                             and set output pins to high
//!       - EPWM_AQ_OUTPUT_TOGGLE_ZERO        - Time base counter equals zero
//!                                             and toggle the output pins
//!       - EPWM_AQ_OUTPUT_NO_CHANGE_PERIOD   - Time base counter equals period
//!                                             and no change in output pins
//!       - EPWM_AQ_OUTPUT_LOW_PERIOD         - Time base counter equals period
//!                                             and set output pins to low
//!       - EPWM_AQ_OUTPUT_HIGH_PERIOD        - Time base counter equals period
//!                                             and set output pins to high
//!       - EPWM_AQ_OUTPUT_TOGGLE_PERIOD      - Time base counter equals period
//!                                             and toggle the output pins
//!       - EPWM_AQ_OUTPUT_NO_CHANGE_UP_CMPA  - Time base counter up equals
//!                                             COMPA and no change in the
//!                                             output pins
//!       - EPWM_AQ_OUTPUT_LOW_UP_CMPA        - Time base counter up equals
//!                                             COMPA and set output pins low
//!       - EPWM_AQ_OUTPUT_HIGH_UP_CMPA       - Time base counter up equals
//!                                             COMPA and set output pins high
//!       - EPWM_AQ_OUTPUT_TOGGLE_UP_CMPA     - Time base counter up equals
//!                                             COMPA and toggle output pins
//!       - EPWM_AQ_OUTPUT_NO_CHANGE_DOWN_CMPA- Time base counter down equals
//!                                             COMPA and no change in the
//!                                             output pins
//!       - EPWM_AQ_OUTPUT_LOW_DOWN_CMPA      - Time base counter down equals
//!                                             COMPA and set output pins low
//!       - EPWM_AQ_OUTPUT_HIGH_DOWN_CMPA     - Time base counter down equals
//!                                             COMPA and set output pins high
//!       - EPWM_AQ_OUTPUT_TOGGLE_DOWN_CMPA   - Time base counter down equals
//!                                             COMPA and toggle output pins
//!       - EPWM_AQ_OUTPUT_NO_CHANGE_UP_CMPB  - Time base counter up equals
//!                                             COMPB and no change in the
//!                                             output pins
//!       - EPWM_AQ_OUTPUT_LOW_UP_CMPB        - Time base counter up equals
//!                                             COMPB and set output pins low
//!       - EPWM_AQ_OUTPUT_HIGH_UP_CMPB       - Time base counter up equals
//!                                             COMPB and set output pins high
//!       - EPWM_AQ_OUTPUT_TOGGLE_UP_CMPB     - Time base counter up equals
//!                                             COMPB and toggle output pins
//!       - EPWM_AQ_OUTPUT_NO_CHANGE_DOWN_CMPB- Time base counter down equals
//!                                             COMPB and no change in the
//!                                             output pins
//!       - EPWM_AQ_OUTPUT_LOW_DOWN_CMPB      - Time base counter down equals
//!                                             COMPB and set output pins low
//!       - EPWM_AQ_OUTPUT_HIGH_DOWN_CMPB     - Time base counter down equals
//!                                             COMPB and set output pins high
//!       - EPWM_AQ_OUTPUT_TOGGLE_DOWN_CMPB   - Time base counter down equals
//!                                             COMPB and toggle output pins
//!
//! \return None.
//
//*****************************************************************************
static inline void EPWM_setActionQualifierActionComplete(uint32_t base,
                                  EPWM_ActionQualifierOutputModule epwmOutput,
                                  EPWM_ActionQualifierEventAction action)
{
    uint32_t registerOffset;

    ASSERT(EPWM_isBaseValid(base));

    // Get the register offset
    registerOffset = EPWM_O_AQCTLA + (uint16_t)epwmOutput;

    // Write to ZRO, PRD, CAU, CAD, CBU or CBD bits of AQCTLA register
    HWREGH(base + registerOffset) = (uint16_t)action;
}

//*****************************************************************************
//
//! Set up Additional action qualifier event outputs
//!
//! \param base is the base address of the EPWM module.
//! \param epwmOutput is the ePWM pin type.
//! \param action is the desired action when the specified event occurs
//!
//! This function sets up the Additional Action Qualifier output on ePWMA or
//! ePWMB depending on the value of epwmOutput, to a value specified by action
//! The following are valid values for the parameters.
//!   - epwmOutput
//!       - EPWM_AQ_OUTPUT_A          - ePWMxA output
//!       - EPWM_AQ_OUTPUT_B          - ePWMxB output
//!   - action
//!       - EPWM_AQ_OUTPUT_NO_CHANGE_UP_TI  - T1 event on count up
//!                                           and no change in output pins
//!       - EPWM_AQ_OUTPUT_LOW_UP_TI        - T1 event on count up
//!                                           and set output pins to low
//!       - EPWM_AQ_OUTPUT_HIGH_UP_TI       - T1 event on count up
//!                                           and set output pins to high
//!       - EPWM_AQ_OUTPUT_TOGGLE_UP_TI     - T1 event on count up
//!                                           and toggle the output pins
//!       - EPWM_AQ_OUTPUT_NO_CHANGE_DOWN_TI- T1 event on count down
//!                                           and no change in output pins
//!       - EPWM_AQ_OUTPUT_LOW_DOWN_TI      - T1 event on count down
//!                                           and set output pins to low
//!       - EPWM_AQ_OUTPUT_HIGH_DOWN_TI     - T1 event on count down
//!                                           and set output pins to high
//!       - EPWM_AQ_OUTPUT_TOGGLE_DOWN_TI   - T1 event on count down
//!                                           and toggle the output pins
//!       - EPWM_AQ_OUTPUT_NO_CHANGE_UP_T2  - T2 event on count up
//!                                           and no change in output pins
//!       - EPWM_AQ_OUTPUT_LOW_UP_T2        - T2 event on count up
//!                                           and set output pins to low
//!       - EPWM_AQ_OUTPUT_HIGH_UP_T2       - T2 event on count up
//!                                           and set output pins to high
//!       - EPWM_AQ_OUTPUT_TOGGLE_UP_T2     - T2 event on count up
//!                                           and toggle the output pins
//!       - EPWM_AQ_OUTPUT_NO_CHANGE_DOWN_T2- T2 event on count down
//!                                           and no change in output pins
//!       - EPWM_AQ_OUTPUT_LOW_DOWN_T2      - T2 event on count down
//!                                           and set output pins to low
//!       - EPWM_AQ_OUTPUT_HIGH_DOWN_T2     - T2 event on count down
//!                                           and set output pins to high
//!       - EPWM_AQ_OUTPUT_TOGGLE_DOWN_T2   - T2 event on count down
//!                                           and toggle the output pins
//!
//! \return None.
//
//*****************************************************************************
static inline void EPWM_setAdditionalActionQualifierActionComplete
                        (uint32_t base,
                        EPWM_ActionQualifierOutputModule epwmOutput,
                        EPWM_AdditionalActionQualifierEventAction action)
{
    uint32_t registerTOffset;

    ASSERT(EPWM_isBaseValid(base));

    // Get the register offset
    registerTOffset = EPWM_O_AQCTLA2 + (uint16_t)epwmOutput;

